Revit 2027 API
ProjectPosition.Elevation Property
 Elevation above ground level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Elevation { get; set; }
Public Property Elevation As Double
	Get
	Set
public:
property double Elevation {
	double get ();
	void set (double value);
}
member Elevation : float with get, set
Property Value
Double
Remarks
 Negative values are allowed. Measured in decimal feet.
See Also
Reference
ProjectPosition Class
Autodesk.Revit.DB Namespace